### Broadcasting
- It's a concept taken from NumPy.
- In the context of Pandas, It's practically the ability to perform arithmatic operation between Arrays or DataFrames of different shapes.
- When we perform operations between 2 objects of different shapes, Pandas automatically aligns the object based on their dimensions and applies the operarion element-wise.
- "Element-wise" refers to performing an operation on each elements of a data structutre or array.

In [17]:
import pandas as pd

In [18]:
data1 = pd.Series([1, 2, 3])
data2 = pd.Series([4, 5, 6])
data1 + data2

0    5
1    7
2    9
dtype: int64

- Note: Any values that interacts with NaN becomes a NaN.
-  Even if the arrays are of different sizes, it will adapt and will not give any error

In [19]:
data3 = pd.Series([10, 20, 30, 40])
data1 + data3

0    11.0
1    22.0
2    33.0
3     NaN
dtype: float64

#### This also goes same for dataframes

In [20]:
df1 = pd.DataFrame(data={'a':[1, 2], 'b': [3, 4]})
df2 = pd.DataFrame(data={'a':[5, 6], 'b': [7, 8]})

df1 + df2

   a   b
0  6  10
1  8  12

In [21]:
df3 = pd.DataFrame(data={'a': [10, 11], 'b': [13, 14], 'c': [15, 16]})
df1 + df3

    a   b   c
0  11  16 NaN
1  13  18 NaN

#### Element wise operartions on our titanic dataset

In [22]:
titanic = pd.read_excel('titanic3.xls', usecols=['name', 'fare', 'survived'])
titanic

      survived                                             name      fare
0            1                    Allen, Miss. Elisabeth Walton  211.3375
1            1                   Allison, Master. Hudson Trevor  151.5500
2            0                     Allison, Miss. Helen Loraine  151.5500
3            0             Allison, Mr. Hudson Joshua Creighton  151.5500
4            0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  151.5500
...        ...                                              ...       ...
1304         0                             Zabour, Miss. Hileni   14.4542
1305         0                            Zabour, Miss. Thamine   14.4542
1306         0                        Zakarian, Mr. Mapriededer    7.2250
1307         0                              Zakarian, Mr. Ortin    7.2250
1308         0                               Zimmerman, Mr. Leo    7.8750

[1309 rows x 3 columns]

In [23]:
titanic['fare']/2

0       105.66875
1        75.77500
2        75.77500
3        75.77500
4        75.77500
          ...
1304      7.22710
1305      7.22710
1306      3.61250
1307      3.61250
1308      3.93750
Name: fare, Length: 1309, dtype: float64

In [24]:
titanic['reduced fare'] = (titanic['fare']/2).round()
titanic

,survived,name,fare,reduced fare
0,1,"Allen, Miss. Elisabeth Walton",211.3375,106.0
1,1,"Allison, Master. Hudson Trevor",151.5500,76.0
2,0,"Allison, Miss. Helen Loraine",151.5500,76.0
3,0,"Allison, Mr. Hudson Joshua Creighton",151.5500,76.0
4,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",151.5500,76.0
...,...,...,...,...
1304,0,"Zabour, Miss. Hileni",14.4542,7.0
1305,0,"Zabour, Miss. Thamine",14.4542,7.0
1306,0,"Zakarian, Mr. Mapriededer",7.2250,4.0
1307,0,"Zakarian, Mr. Ortin",7.2250,4.0
1308,0,"Zimmerman, Mr. Leo",7.8750,4.0